---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SiteFailures.SurfaceSelfIntersection
source: html/dd9d049f-8c2a-8f12-db05-ebec0a50a9fb.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SiteFailures.SurfaceSelfIntersection Property

The splitting boundary drawn would result in a self-intersection of the surface boundary. Please edit your splitting lines to correct the problem.

## Syntax (C#)
```csharp
public static FailureDefinitionId SurfaceSelfIntersection { get; }
```